package HomeWork02;

public class HomeWork_02 {
    public static void main(String[] args) {
        int count = 1;
        while (count <= 99) {
            System.out.println(count);
            count += 2;
        }
    }
}

//2. Создайте программу, выводящую на экран первые
//55 элементов последовательности 1 3 5 7 9 11 13 15 17 ….