package HomeWork02;

public class HomeWork_01 {
    public static void main(String[] args) {
        int count = 1000;
        while (count < 10000) {
            System.out.println(count);
            count += 3;
        }
    }
}

//1. Создайте программу, выводящую на экран
//все четырёхзначные числа последовательности 1000 1003 1006 1009 1012 1015 ….
