package HomeWork02;

public class HomeWork_03 {
    public static void main(String[] args) {
        int count = 90;
        while (count >= 0) {
            System.out.println(count);
            count -= 5;
        }
    }
}

//3. Создайте программу, выводящую на экран все неотрицательные
// элементы последовательности 90 85 80 75 70 65 60 ….