package HomeWork02;

public class HomeWork_04 {
    public static void main(String[] args) {
        for (int i = 1, count = 2; i <= 20; count = count * 2, i++) {
            System.out.println(count);
        }
    }
}

//4. Создайте программу, выводящую на экран первые 20
// элементов последовательности 2 4 8 16 32 64 128 256 512 1024
// 2048 4096 8192 16384 32768 65536 131072 262144 524288 1048576 ….