package java_essential.homeworks.homework02;


/**
 * Клас содержащий имена для персонажей всех рас. Эти имена необходимы для компьютера.
 * Из них он случайным образом выбирает имя своим персонажам.
 */

public class Constants {
    public static final String[] RACES = {"человек", "эльф", "гном", "орк", "демон", "рыцарь нежити", "зверочеловек"};
    public static String[] humanNames = {"Доран", "Вальтер", "Родерик", "Каспиас", "Роланд", "Ардоберт", "Верок", "Винфрид", "Виргилий", "Вольфгар", "Гелдвин", "Герберт", "Гильберт", "Гоар", "Годфруа", "Гюнтер", "Дагар", "Зардомас", "Кловис", "Конрад", "Лотар", "Мерло", "Нигель", "Отон", "Райнон", "Ренар", "Роллон", "Сэйвери", "Тефас", "Туэдон", "Урбан", "Эдвин", "Эмери", "Юрон", "Юстин"};
    public static String[] elfNames = {"Эридиэль", "Илюмиэль", "Лориас", "Элиниэль", "Лануил", "Элриал", "Галадриэль", "Эллейн", "Туриэль", "Аэллос", "Береграс", "Дорэйвен", "Ильдест", "Исниль", "Йона'ас", "Кера'анил", "Лемвер", "Лиминдель", "Линдаллос", "Оллен", "Оук", "Сивид", "Сола'ан", "Торн", "Эборен", "Эла'ах", "Элдис", "Элламенд", "Эрвиль", "Эриспен", "Эсниллен"};
    public static String[] dwarfNames = {"Альдерик", "Аталок", "Атаульф", "Бальдарик", "Бертин", "Бродульф", "Витерик", "Вотерим", "Гандальф", "Гаугерик", "Годерик", "Дагарик", "Дрогон", "Дроктальф", "Кагнерик", "Кальдерик", "Клодерик", "Лантфрид", "Лейф", "Магнерик", "Марилейф", "Радульф", "Ромарик", "Сегерик", "Сигальф", "Теодемис", "Трудальф", "Фулрад", "Хейрик", "Хрольф", "Чарульф", "Эрарик", "Эфрой"};
    public static String[] undeadNames = {"Андраш", "Армистар", "Ассам", "Вааст", "Гангрен", "Гениалиишь", "Гозлен", "Гуджерат", "Дагот", "Зигреаль", "Зитар", "Лан-Дуул", "Лим-Шива", "Мутрэль", "Неру", "Нигош", "Отера", "Потэль", "Прадеш", "Раджастам", "Сикким", "Терог", "Тефас", "Тиффас", "Умеру", "Хагог", "Хаграэль", "Хонир'йа", "Хуун'ре"};
    public static String[] demonNames = {"Аасгорот", "Абрааль", "Асумуэль", "Баал", "Баалу", "Бегрезен", "Бегрот", "Белиал", "Бельфгор", "Ворамель", "Геконроль", "Грах’эль", "Гунра", "Даквель", "Дамьен", "Жугнам", "Драгог", "Загамон", "Заориш", "Зеура", "Идразель", "Иснеграк", "Итрен", "Кахат", "Кахуэль", "Кринин", "Лоуфмир", "Магот", "Манон", "Мидредэль", "Огрезем", "Сагот", "Сегурот", "Тагот", "Тхотгель'ир", "Ушкен'Ра", "Хазки'ла", "Хиграль", "Хильмек'ру", "Экрезем"};
    public static String[] orcNames = {"Азог", "Балкмег", "Болдог", "Больг", "Гольфимбул", "Горбаг", "Готмог", "Гришнак", "Лагдуф", "Луг", "Лугдуш", "Лурц", "Маухур", "Музгаш", "Нарзуг", "Оркобал", "Отрод", "Радбуг", "Снага", "Углук", "Уфтак", "Фимбул", "Шаграт", "Шарку", "Язнег"};
    public static String[] werebeastNames = {"Винель", "Хелен", "Борис", "Криста", "Энни", "Мара", "Джон", "Кристиан", "Лилли"};
}
