package HomeWork01;

public class HomeWork_8 {
    public static void main(String[] args) {

    }
}

//Задание 8
//Используя IntelliJ IDEA, создайте класс homework01.IntervalError.
//Напишите программу определения, попадает ли введенное пользователем число от 0 до 100 в числовой
//промежуток [0 - 14] [15 - 35] [36 - 50] [50 - 100]. Если да, то укажите, в какой именно промежуток.
//Если пользователь указывает число не входящее ни в один из имеющихся числовых промежутков, то
//выводится соответствующее сообщение.
